fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеКолЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
		НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	КонецПроцедуры
	
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		// Акт оказанных услуг
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "АктУслуг";
		КомандаПечати.Представление = НСтр("ru = 'Акт услуг'");
		КомандаПечати.Порядок = 20;
		
	КонецПроцедуры
	
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктУслуг");
		Если ПечатнаяФорма <> Неопределено Тогда
			ПечатнаяФорма.ТабличныйДокумент = ПечатьАкта(МассивОбъектов, ОбъектыПечати);
			ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт услуг'");
			ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ВКМ_ОбслуживаниеКлиента.ПФ_MXL_АктУслуг";
		КонецЕсли;
		
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	Функция ПечатьАкта(МассивОбъектов, ОбъектыПечати)
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктУслуг";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВКМ_ОбслуживаниеКлиента.ПФ_MXL_АктУслуг");
		
		ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);
		
		ПервыйДокумент = Истина;
		
		Пока ДанныеДокументов.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				// Все документы нужно выводить на разных страницах.
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
			
			ВывестиРеквизитыСторон(ДанныеДокументов, ТабличныйДокумент, Макет);
			
			ВывестиТоварыУслугиАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
			
			ВывестиПодвалЗаказа(ДанныеДокументов, ТабличныйДокумент, Макет);
			
			// В табличном документе необходимо задать имя области, в которую был 
			// выведен объект. Нужно для возможности печати комплектов документов.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеДокументов.Ссылка);
			
		КонецЦикла;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции
	
	Функция ПолучитьДанныеДокументов(МассивОбъектов)
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка,
		|	ВКМ_ОбслуживаниеКлиента.Номер КАК НомерКлиента,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК ДатаКлиента,
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ОписаниеРабот КАК ОписаниеРабот,
		|		ПлановоеКолЧасов КАК ПлановоеКолЧасов,
		|		ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту
		|	) КАК ВыполненныеРаботы,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка В(&МассивОбъектов)";
		
		Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
		
		Возврат Запрос.Выполнить().Выбрать();
		
	КонецФункции
	
	Процедура ВывестиЗаголовокАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
		
		ОбластьЗаголовокДокумента = Макет.ПолучитьОбласть("Заголовок");
		
		ДанныеПечати = Новый Структура;
		
		ШаблонЗаголовка = "Акт оказанных услуг %1 от %2";
		ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка, ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.НомерКлиента),
		Формат(ДанныеДокументов.ДатаКлиента, "ДЛФ=DD"));
		ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
		
		ОбластьЗаголовокДокумента.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
		
	КонецПроцедуры
	
	Процедура ВывестиРеквизитыСторон(ДанныеДокументов, ТабличныйДокумент, Макет)
		
		ОбластьПоставщик = Макет.ПолучитьОбласть("Покупатель");
		ОбластьПокупатель = Макет.ПолучитьОбласть("Покупатель");
		
		ДанныеПечати = Новый Структура;
		ДанныеПечати.Вставить("ПредставлениеПоставщика", ДанныеДокументов.Специалист);
		ДанныеПечати.Вставить("ПредставлениеПокупателя", ДанныеДокументов.Клиент);
		ДанныеПечати.Вставить("Основание", ДанныеДокументов.Договор);
		
		ОбластьПоставщик.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьПоставщик);
		
	КонецПроцедуры
	
	Процедура ВывестиТоварыУслугиАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
		
		ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
		ОбластьПодвал 			= Макет.ПолучитьОбласть("Подвал");
		ОбластьИтого 			= Макет.ПолучитьОбласть("Итого");
		ОбластьИтогоПрописью 	= Макет.ПолучитьОбласть("ИтогоПрописью");
		
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		РаботыУслуги = ДанныеДокументов.ВыполненныеРаботы.Выбрать();
		
		ВыполненныеРаботыУслуги = Новый Структура;
		
		ЧасыКОплате = 0;
		
		Пока РаботыУслуги.Следующий() Цикл
			
			ВыполненныеРаботыУслуги.Вставить("НомерСтроки", РаботыУслуги.НомерСтроки);
			ВыполненныеРаботыУслуги.Вставить("ОписаниеРабот", РаботыУслуги.ОписаниеРабот);
			ВыполненныеРаботыУслуги.Вставить("ПланЧас", РаботыУслуги.ПлановоеКолЧасов);
			ВыполненныеРаботыУслуги.Вставить("ФактЧас", РаботыУслуги.ЧасыКОплатеКлиенту);	
			ВыполненныеРаботыУслуги.Вставить("КОплате", РаботыУслуги.ЧасыКОплатеКлиенту * ДанныеДокументов.СтоимостьЧасаРаботы);
			
			ОбластьСтрока.Параметры.Заполнить(ВыполненныеРаботыУслуги);
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ЧасыКОплате = ЧасыКОплате + РаботыУслуги.ЧасыКОплатеКлиенту;	
			
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		КОплатеПоДокументу = ЧасыКОплате *  ДанныеДокументов.СтоимостьЧасаРаботы;
		
		ЧислоПрописью = ЧислоПрописью(КОплатеПоДокументу, "ru_RU",
		"рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
		
		ДанныеПечати = Новый Структура;
		ДанныеПечати.Вставить("Всего", КОплатеПоДокументу);
		ДанныеПечати.Вставить("ВсегоПрописью", ЧислоПрописью);
		
		ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьИтого);
		
		ОбластьИтогоПрописью.Параметры.Заполнить(ДанныеПечати);
		ТабличныйДокумент.Вывести(ОбластьИтогоПрописью);
		
	КонецПроцедуры
	
	
	Процедура ВывестиПодвалЗаказа(ДанныеДокументов, ТабличныйДокумент, Макет)
		
		ОбластьПодвалЗаказа = Макет.ПолучитьОбласть("ПодвалЗаказа");
		
		ТабличныйДокумент.Вывести(ОбластьПодвалЗаказа);
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
